import React from 'react'
import style from './Footer.module.scss'
const Footer = () => {
    return (
        <footer className={style.footer}>
            <h2>
                Адреса
            </h2>
            <div className={style.adressWrapper}>
                <p className={style.paragraph}>
                    Зорге, 19/162 <br /> по будням с 10:00 до 20:00 <br /> сб-вс с 10:00 до 20:00
                </p>
                <p className={style.paragraph}>Соколова, 21/19 <br />Пн-Сб с 10:00 до 20:00 <br />воскресенье – выходной</p>
            </div>
            <div className={style.phoneAndIcon}>
                <svg className={style.iconPhone} width="56" height="56" viewBox="0 0 56 56"  xmlns="http://www.w3.org/2000/svg">
                    <circle cx="28" cy="28" r="28" transform="matrix(-1 0 0 1 56 0)" fill="#E31D77" />
                    <path d="M39.9997 34.0472V37.5503C40.001 37.8755 39.9344 38.1974 39.8043 38.4953C39.6741 38.7933 39.4832 39.0608 39.2438 39.2806C39.0043 39.5005 38.7217 39.6679 38.4139 39.772C38.1061 39.8762 37.7799 39.9149 37.4563 39.8857C33.8663 39.4952 30.4178 38.2674 27.388 36.3008C24.5691 34.508 22.1792 32.116 20.388 29.2946C18.4163 26.2483 17.1893 22.78 16.8063 19.1707C16.7772 18.8478 16.8155 18.5223 16.9189 18.2151C17.0223 17.9078 17.1885 17.6255 17.4069 17.386C17.6253 17.1466 17.8911 16.9552 18.1874 16.8242C18.4838 16.6932 18.8041 16.6254 19.128 16.6251H22.628C23.1942 16.6195 23.7431 16.8202 24.1724 17.1897C24.6017 17.5593 24.8821 18.0724 24.9613 18.6336C25.1091 19.7546 25.383 20.8554 25.778 21.9148C25.935 22.3327 25.969 22.787 25.8759 23.2236C25.7829 23.6603 25.5667 24.0611 25.253 24.3786L23.7713 25.8616C25.4322 28.785 27.8505 31.2055 30.7713 32.8678L32.253 31.3848C32.5702 31.0709 32.9707 30.8545 33.407 30.7614C33.8433 30.6682 34.2971 30.7022 34.7147 30.8593C35.7732 31.2547 36.8729 31.5289 37.993 31.6767C38.5597 31.7568 39.0773 32.0425 39.4473 32.4795C39.8173 32.9166 40.0139 33.4745 39.9997 34.0472Z" fill="white" />
                </svg>
                <p className={style.phone}>+7 (909) 40 40 140</p>
            </div>
            <ul className={style.listOfSocial}>
                <li className={style.liOfSocial}>Telegram</li>
                <li className={style.liOfSocial}>WhatsApp</li>
                <li className={style.liOfSocial}>Вконтакте</li>
            </ul>
        </footer>
    )
}

export default Footer